cf/BusinessProcesses/СогласованиеАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеАссортимента</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Письмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСогласование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеАссортимента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаЦен</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокИнициаторов</Name>
							<Comment>для печатной формы КП</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/BusinessProcesses/СогласованиеАссортимента/Ext/ManagerModule.bsl
&НаСервере
Функция Печать(ТабДок, Ссылка)  Экспорт
		
	Макет = БизнесПроцессы.СогласованиеАссортимента.ПолучитьМакет("СогласованиеАссортимента");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОБластьШапка.Параметры.Заголовок = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата", Ссылка.Номер, Ссылка.Дата), "Коммерческое предложение");
	
	стрПартнеры = "";
	Для Каждого Элемент ИЗ Ссылка.Партнеры Цикл
	 	стрПартнеры = стрПартнеры + ", " + Строка(Элемент.Партнер);
	КонецЦикла;
	
	ОбластьШапка.Параметры.Заказчик = Сред(стрПартнеры, 2);
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ном = 0;
	Для Каждого Строка ИЗ Ссылка.Товары Цикл ном = ном + 1;
		ОбластьСтрокаТаблицы.Параметры.Номер			= ном; 
		ОбластьСтрокаТаблицы.Параметры.Наименование 	= Строка.Номенклатура;
		ОбластьСтрокаТаблицы.Параметры.Артикул 			= Строка.Номенклатура.Артикул;
		ОбластьСтрокаТаблицы.Параметры.Производитель 	= Строка.Номенклатура.Производитель;
		ОбластьСтрокаТаблицы.Параметры.ЕдИзм			= Строка.Номенклатура.ЕдиницаИзмерения;
		ОбластьСтрокаТаблицы.Параметры.Цена 			= Строка.ЦенаСогласования;
		ОбластьСтрокаТаблицы.Параметры.Инициаторы		= Строка.СписокИнициаторов;
	//	ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы, Строка);
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
КонецФункции
